<?php

declare(strict_types=1);

return [
    'login_failed'           => 'Невірний email або пароль.',
    'login_success'          => 'Ви успішно увійшли в систему.',
    'logout_success'         => 'Ви успішно вийшли з системи.',
    'register_success'       => 'Реєстрація пройшла успішно.',
    'throttle'               => 'Забагато спроб входу. Будь ласка, спробуйте ще раз, через :seconds секунд.',
    'reset_subject'          => 'Код відновлення паролю',
    'reset_title'            => 'Відновлення пароля',
    'reset_greeting'         => 'Ви отримали цей лист, тому що ми отримали запит на скидання пароля для вашого акаунта.',
    'reset_code_intro'       => 'Ось ваш код підтвердження:',
    'reset_footer'           => 'Код дійсний 15 хвилин. Якщо ви не робили цей запит, просто проігноруйте цей лист.',
    'reset_send'             => 'Код для скидання пароля надіслано на вашу електронну адресу.',
    'reset_not_send'         => 'Під час надсилання коду сталася помилка. Спробуйте ще раз.',
    'invalid_code'           => 'Код недійсний.',
    'code_expired'           => 'Термін дії коду закінчився.',
    'code_valid'             => 'Код підтверджено.',
    'password_reset_success' => 'Ваш пароль був успішно скинутий.',
    'email_already_verified' => 'Електронна адреса вже підтверджена.',
    'email_verified_success' => 'Електронна адреса успішно підтверджена.',
    'verify_subject'         => 'Підтвердження електронної пошти',
    'verify_title'           => 'Підтвердження електронної пошти',
    'verify_greeting'        => 'Дякуємо за реєстрацію!',
    'verify_code_intro'      => 'Щоб завершити створення акаунта, будь ласка, введіть цей код підтвердження у додатку:',
    'verify_footer'          => 'Цей код дійсний протягом 24 годин. Якщо ви не реєструвалися на нашому сервісі, просто проігноруйте цей лист.',
    'verify_code_resent'     => 'Код підтвердження було повторно надіслано на вашу електронну адресу.',
];
