<?php

return [
    'created'           => 'Успішно створено.',
    'creation_failed'   => 'Створення не вдалося.',
    'updated'           => 'Успішно оновлено.',
    'update_failed'     => 'Оновлення не вдалося.',
    'deleted'           => 'Успішно видалено.',
    'deletion_failed'   => 'Видалення не вдалося.',
    'not_found'         => 'Не знайдено.',
    'empty'             => 'Немає доступних даних.',
    
    'error_below_zero'  => 'Ціна для фіксованого типу не може бути від\'ємною.'
];
