<?php

return [
    'created'           => 'Успішно створено.',
    'creation_failed'   => 'Створення не вдалося.',
    'updated'           => 'Успішно оновлено.',
    'update_failed'     => 'Оновлення не вдалося.',
    'deleted'           => 'Успішно видалено.',
    'deletion_failed'   => 'Видалення не вдалося.',
    'not_found'         => 'Не знайдено.',
    'empty'             => 'Немає доступних даних.',
    
    'error_below_zero'  => 'Ціна для фіксованого типу не може бути від\'ємною.',
    
    'book_unavailable'       => 'Ця книга тимчасово недоступна для оренди.',
    'rental_period_exceeded' => 'Максимальний період оренди це :days днів.',    
    'not_canceled'           => 'Тільки оренда в статусі "Очікує видачі" може бути скасована.',
    'canceled'               => 'Оренда успішно скасована.',
    'refund_initiated'       => 'Оренда скасована. Гроші будут повернені менеджером пізніше.',
];
